app/views/users/index.html.erb

    <div class="mypages">
    <% @user.pages.each do |page| %>
---
SELECT "pages".* FROM "pages" WHERE "pages"."user_id" = ?  [["user_id", 1]]