app/views/pages/index.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."user_id" = ?  [["user_id", 1]]
---
        <% @users.each do |user| %>
            <% user.pages.each do |page| %>