app/controllers/comments_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "page_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "first\r\n"], ["page_id", 1], ["created_at", "2020-08-06 15:07:03.733050"], ["updated_at", "2020-08-06 15:07:03.733050"], ["user_id", 2]]
---
    def create
        @page = Page.find(params[:page_id])
        @comment = @page.comments.create(comment_params)

        @comment.user = current_user

        if @comment.save