app/controllers/pages_controller.rb

INSERT INTO "pages" ("title", "created_at", "updated_at", "user_id", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "first"], ["created_at", "2020-08-24 16:32:13.145861"], ["updated_at", "2020-08-24 16:32:13.145861"], ["user_id", 1], ["description", "description of the first page."]]
---
    def create
        @user = current_user
        @page = @user.pages.create(page_params)

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pages" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "Thoughts on the (Edit)?"], ["description", "Hey everyone, what has your experience with covid been like so far?"], ["updated_at", "2020-08-20 22:47:48.400515"], ["id", 1]]
---
    def update
        @page = Page.find(params[:id])

        if @page.update(page_params)

SELECT  "pages".* FROM "pages" WHERE "pages"."user_id" = ? AND "pages"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
    def destroy
       @user = current_user
       @page = @user.pages.find(params[:id])

       @page.destroy