app/controllers/users_controller.rb

    def index
        @user = current_user
        @pages = Page.all
---
SELECT "pages".* FROM "pages" WHERE "pages"."user_id" = ?  [["user_id", 1]]